mdmfile/src/Catalogs/мдмРеквизиты/мдмРеквизиты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>мдмРеквизиты</name>
  <owners>Catalog.мдмСхемыДанных</owners>
  <owners>Catalog.мдмТабличныеЧасти</owners>
  <owners>Catalog.мдмФормыДанных</owners>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Синоним</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПредставление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеЗаполнения</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеСсылки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

mdmfile/src/Catalogs/мдмРеквизиты/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Тип = ТекущийОбъект.Тип.Получить();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Перем ЗначениеКопирования;
	
	УстановитьДопустимыеТипыРеквизита();
	
	Если Параметры.Свойство("ЗначениеКопирования", ЗначениеКопирования) И ЗначениеЗаполнено(ЗначениеКопирования) Тогда
		
		Тип = ЗначениеКопирования.Тип.Получить();
		
	КонецЕсли;	
	
	Элементы.ЗначениеЗаполнения.Видимость = (ТипЗнч(Объект.Владелец) = Тип("СправочникСсылка.мдмСхемыДанных"));
	Элементы.ЗначениеЗаполнения.СвязьПоТипу = Новый СвязьПоТипу("Тип");
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Тип = Новый ХранилищеЗначения(Тип);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ОписаниеОповещенияОЗакрытии <> Неопределено Тогда
		
		ВыполнитьОбработкуОповещения(ОписаниеОповещенияОЗакрытии);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДопустимыеТипыРеквизита()
	
	Элементы.Тип.ДоступныеТипы = мдмМетаданные.ДопустимыеТипыРеквизитов();
	
КонецПроцедуры	

&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	
	Объект.ТипПредставление = мдмМетаданныеВызовСервера.ПредставлениеТипа(Тип);
	
КонецПроцедуры
